-- 각 테이블에 대한 INSERT 문
-- 데이터 요구사항
-- -> 프로그램 로직이 충분히 드러날 수 있게끔
--    케이스 Variation 이 반영된 더미 데이터 필요

insert into poke_dex -- 도감에 포켓몬 작성
values (1, '번개', '피카츄', 50, '백만볼트', 20, null, null, null),
       (2, '물','꼬부기', 60, '물대포', 15, null, null, null),
       (3, '비행','구구', 30, '부리로 쪼기', 10, null, null, null),
       (4, '땅', '꼬렛', 40, '꺠물기', 10, null, null, null),
       (5, '요정', '삐삐', 100, '손가락 흔들기', 0, null, null, null),
       (6, '요정', '푸린', 100, '노래부르기', 0, null, null, null),
       (7, '땅', '근육몬', 1000, '4연속 펀치', 400, null, null, null), -- 아래부터 진화 포켓몬
       (8, '물','어니부기', 120, '물대포', 15, '거품광선', 30, 2),
       (9, '요정','픽시', 200, '손가락 흔들기', 0, '최면 광선', 20, 5),
       (10, '요정', '푸크린', 120, '노래부르기', 0, '낙서', 100, 6),
       (11, '땅', '괴력몬', 3000, '4연속 펀치', 400, '8연속 펀치', 800, 7);


-- 트레이너 더미 데이터 생성
INSERT INTO pokemon_trainer (name, capturedPokemon)
VALUES
    ('Trainer1', '{"피카츄": 1, "꼬부기": 1, "구구": 1, "꼬렛": 1, "삐삐": 1, "푸린": 1, "근육몬": 1, "어니부기": 1, "픽시": 1, "푸크린": 1, "괴력몬": 1}'),
    ('Trainer2', '{"피카츄": 15}'),
    ('Trainer3', '{"꼬부기": 2, "구구": 2, "푸린": 2, "어니부기": 2, "픽시": 2, "푸크린": 2, "괴력몬": 2}'),
    ('Trainer4', '{"피카츄": 3, "어니부기": 3, "꼬부기": 3, "픽시": 3, "푸크린": 3, "괴력몬": 3}'),
    ('Trainer5', '{"피카츄": 5, "어니부기": 2, "꼬부기": 1, "픽시": 1}'),
    ('Trainer6', '{"어니부기": 10, "푸크린": 10}'),
    ('Trainer7', '{"구구": 5, "픽시": 5, "괴력몬": 5}'),
    ('Trainer8', '{"어니부기": 1, "픽시": 2, "푸크린": 2, "괴력몬": 1}'),
    ('Trainer9', '{"푸린": 5, "어니부기": 5}'),
    ('Trainer10', '{"피카츄": 2, "어니부기": 2, "픽시": 2, "푸크린": 2, "괴력몬": 2}'),
    ('Trainer11', '{"피카츄": 5, "푸린": 5, "어니부기": 1}'),
    ('Trainer12', '{"어니부기": 5, "픽시": 5, "푸크린": 1}'),
    ('Trainer13', '{"꼬렛": 5, "푸크린": 5, "어니부기": 1}'),
    ('Trainer14', '{"푸린": 5, "어니부기": 5, "괴력몬": 1}'),
    ('Trainer15', '{"피카츄": 5, "푸린": 5, "어니부기": 1}'),
    ('Trainer16', '{"푸린": 5, "픽시": 5, "괴력몬": 1}'),
    ('Trainer17', '{"어니부기": 10, "픽시": 2, "푸크린": 2, "괴력몬": 2}'),
    ('Trainer18', '{"어니부기": 5, "푸린": 5}'),
    ('Trainer19', '{"피카츄": 5, "어니부기": 5, "픽시": 5, "푸크린": 5, "괴력몬": 5}'),
    ('Trainer20', '{"어니부기": 10, "푸린": 2, "픽시": 2, "푸크린": 2, "괴력몬": 2}');
